

class BotMessage:
    new_cash_account_done = """یه خبر خوب! حساب *{name}* به فهرست حساب های شما اضافه شد.
حالا میتونی به صفحه اصلی بازو بری *یا* یه حساب دیگه اضافه کنی."""

    accept_to_add_your_accounts = "آیا حساب نقدی به نام *{name}* و با میزان موجودی *{amount}* ریال به حساب های شما اضافه بشه ؟"
    enter_amount_of_cash = "مقدار *مبلغی* که الان توی *{name}* داری رو به *ریال* و به صورت *عدد* وارد کن"
    choose_name_for_cash = """لطفا برای پول نقد خودت یک اسم تعیین کن. مثلا *کیف پول* یا *پول روی طاقچه*"""
    choose_service = "*{name}* عزیز،" \
                     " برای شروع لازم هست که یک حساب بانکی یا یک حساب نقد(مثل کیف پول)" \
                     "  تعریف کنی تا بتونم دخل و خرج مربوط به اون حساب رو ثبت کنم."
    enter_name = "لطفا اسم خودت رو وارد کن تا باهم آشنا بشیم :)"
    starter_message = "چه کاری میتونم برات انجام بدم:"
    greeting_message = "من بازوی مدیریت مالی هوشمند جیبان ام. به کمک من میتونی به راحتی و با لذت به مدیریت دخل و خرجات برسی. من با امکاناتی که در اخیارت قرار میدم قطعا شگفت زده ات میکنم، پس هرچه سریعتر شروع کن :)"
